<?php 
#############################################################################
#define("DB_HOST",     "localhost"          ); // адрес сервера баз данных  #
#define("DB_USER",     "j55600682"          ); // имя пользователя          #
#define("DB_PWD",      "j55600682"          ); // пароль к бд               #
#define("DB_NAME",     "j55600682_searchdekanat"   ); // имя базы данных    #
#define("DB_MODE",                         2); // 0 - в ручную откр/закр,   #
#############################################################################
#############################################################################
define("DB_HOST",     "localhost"          ); // адрес сервера баз данных   #
define("DB_USER",     "root"               ); // имя пользователя           #
define("DB_PWD",      ""                   ); // пароль к бд                #
define("DB_NAME",     "searchdekanat"      ); // имя базы данных            #
define("DB_MODE",                         2); // 0 - в ручную откр/закр,    #
############################################################################# 
?>