<html> 

<p></p>
<p></p>
<p></p> 
<table bgcolor="#999999" height=20 width="99%" cellspacing="1" cellpadding="1" border="0">
<tr>
<td align="left" valign="top" bgcolor=" LightYellow">
 <p></p> 
 <p><font  color="Gray" size="4">
     <br>
     &nbsp;&nbsp;&nbsp;&nbsp;
     <Strong>Целью настоящей работы является создание прототипа ИС деканата института</Strong> 
     по учету и поиску студентов, успеваимости студентов. 
     Система поддерживает регистрацию и авторизацию пользователей студентов. Система ориентирована на две группы пользователей: студентов и администратора, 
	 функции которых регламентированы личными кабинетами пользователей.
	 Администратор имеет доступ к данным системы для добавления, обновления, удаления данных.
	 Система поддерживает различные виды поиска данных по успеваимости студентов.
	 <br>
	 &nbsp;&nbsp;&nbsp;&nbsp;
     <Strong>В качестве платформы для программной реализации </Strong>используется хостинг с платформой семейства Unix-Linux с сервером приложений Apache. 
	 В приложении используется СУБД MySQL, язык программирования PHP. Для создания веб-страниц используется язык разметки HTML.
     Главной целью изучения является реализация принципов работы языка PHP при обработке баз данных в формате MySQL и языком запросов к базам данных SQL.
     <br>&nbsp;&nbsp;&nbsp;&nbsp;
     <Strong>Приложение позволяет выполнять следующие функции:</Strong>
     <br>&nbsp;&nbsp;&nbsp;&nbsp;
     >>> Добавлять новых студентов в базу данных (регистрация);
     <br>&nbsp;&nbsp;&nbsp;&nbsp;
     >>> Обновлять данные системы администратором;
     <br>&nbsp;&nbsp;&nbsp;&nbsp;
     >>> Удалять студентов из базы данных администратором;
     <br>&nbsp;&nbsp;&nbsp;&nbsp;
     >>> Оформлять онлайн заявки в деканат на получение необходимых документов по успеваимости.	 
     <!--br>&nbsp;&nbsp;&nbsp;&nbsp;
     >>> Производить поиск студентов по нескольким ключам поиска.
     <br//-->&nbsp;&nbsp;&nbsp;&nbsp;
   </font>
 </p>
<br> 
</td>
</tr> 
</table>
<p></p>
<p></p>

<html> 